caniggia1/Arduino_Core_STM32_1.0.1/STM32/hardware/stm32/1.0.1/boards.txt
# See: https://github.com/arduino/Arduino/wiki/Arduino-IDE-1.5-3rd-party-Hardware-specification

menu.pnum=Board part number

menu.xserial=Extra serial instance
menu.usb=USB interface

menu.opt=Optimize
menu.upload_method=Upload method

################################################################################
# Generic F1 Boards

generic_F1.name=Generic F1 Boards

#generic_F1.build.vid=0x0483
#generic_F1.build.pid=0x5711
#generic_F1.vid.0=0x0483
#generic_F1.pid.0=0x5711

generic_F1.build.core=arduino
generic_F1.build.board=generic_F1
generic_F1.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}

# Generic F103CB
# Support: Serial1 (USART1 on PA10, PA9) and Serial2 (USART3 on PC11, PC10)
generic_F1.menu.pnum.generic_F103CB=Generic F103CB
#generic_F1.menu.pnum.Generic_F103CB.node="NODE_F103RB,NUCLEO"
generic_F1.menu.pnum.generic_F103CB.node="NODE_generic_F103CB"
generic_F1.menu.pnum.generic_F103CB.upload.maximum_size=131072
generic_F1.menu.pnum.generic_F103CB.upload.maximum_data_size=20480
generic_F1.menu.pnum.generic_F103CB.build.mcu=cortex-m3
generic_F1.menu.pnum.generic_F103CB.build.f_cpu=72000000L
generic_F1.menu.pnum.generic_F103CB.build.board=generic_F103CB
generic_F1.menu.pnum.generic_F103CB.build.series=STM32F1xx
generic_F1.menu.pnum.generic_F103CB.build.product_line=STM32F103xB
generic_F1.menu.pnum.generic_F103CB.build.variant=generic_F103CB
generic_F1.menu.pnum.generic_F103CB.build.cmsis_lib_gcc=arm_cortexM3l_math

# Generic F103T6
# Support: Serial1 (USART1 on PA10, PA9)
generic_F1.menu.pnum.generic_F103T6=Generic F103T6
#generic_F1.menu.pnum.Generic_F103T6.node="NODE_F103RB,NUCLEO"
generic_F1.menu.pnum.generic_F103T6.node="NODE_generic_F103T6"
generic_F1.menu.pnum.generic_F103T6.upload.maximum_size=32768
generic_F1.menu.pnum.generic_F103T6.upload.maximum_data_size=10240
generic_F1.menu.pnum.generic_F103T6.build.mcu=cortex-m3
generic_F1.menu.pnum.generic_F103T6.build.f_cpu=72000000L
generic_F1.menu.pnum.generic_F103T6.build.board=generic_F103T6
generic_F1.menu.pnum.generic_F103T6.build.series=STM32F1xx
generic_F1.menu.pnum.generic_F103T6.build.product_line=STM32F103x6
generic_F1.menu.pnum.generic_F103T6.build.variant=generic_F103T6
generic_F1.menu.pnum.generic_F103T6.build.cmsis_lib_gcc=arm_cortexM3l_math

# Upload menu
generic_F1.menu.upload_method.STLink=STLink
generic_F1.menu.upload_method.STLink.upload.protocol=STLink
generic_F1.menu.upload_method.STLink.upload.tool=stlink_upload

################################################################################
# Other boards

Other.name=Other

#Other.build.vid=0x0483
#Other.build.pid=0x5711
#Other.vid.0=0x0483
#Other.pid.0=0x5711

Other.build.core=arduino
Other.build.board=Other
Other.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} {build.upload_flags}

# BLUEPILL_F103C8 board
# Support: USB HID, Serial2 (USART2 on PA3, PA2) and Serial3 (USART3 on PB11, PB10)
Other.menu.pnum.BLUEPILL_F103C8=BluePill F103C8
Other.menu.pnum.BLUEPILL_F103C8.node=NODE_F103C8
Other.menu.pnum.BLUEPILL_F103C8.upload.maximum_size=65536
Other.menu.pnum.BLUEPILL_F103C8.upload.maximum_data_size=20480
Other.menu.pnum.BLUEPILL_F103C8.build.mcu=cortex-m3
Other.menu.pnum.BLUEPILL_F103C8.build.f_cpu=72000000L
Other.menu.pnum.BLUEPILL_F103C8.build.board=BLUEPILL_F103C8
Other.menu.pnum.BLUEPILL_F103C8.build.series=STM32F1xx
Other.menu.pnum.BLUEPILL_F103C8.build.product_line=STM32F103xB
Other.menu.pnum.BLUEPILL_F103C8.build.variant=BLUEPILL_F103C8
Other.menu.pnum.BLUEPILL_F103C8.build.cmsis_lib_gcc=arm_cortexM3l_math

# MAPLEMINI_F103CB board
# Support: USB HID, Serial2 (USART2 on PA3, PA2) and Serial3 (USART3 on PB11, PB10)
Other.menu.pnum.MAPLEMINI_F103CB=MapleMini F103CB
Other.menu.pnum.MAPLEMINI_F103CB.node=NODE_F103CB
Other.menu.pnum.MAPLEMINI_F103CB.upload.maximum_size=131072
Other.menu.pnum.MAPLEMINI_F103CB.upload.maximum_data_size=20480
Other.menu.pnum.MAPLEMINI_F103CB.build.mcu=cortex-m3
Other.menu.pnum.MAPLEMINI_F103CB.build.f_cpu=72000000L
Other.menu.pnum.MAPLEMINI_F103CB.build.board=MAPLEMINI_F103CB
Other.menu.pnum.MAPLEMINI_F103CB.build.series=STM32F1xx
Other.menu.pnum.MAPLEMINI_F103CB.build.product_line=STM32F103xB
Other.menu.pnum.MAPLEMINI_F103CB.build.variant=MAPLEMINI_F103CB
Other.menu.pnum.MAPLEMINI_F103CB.build.cmsis_lib_gcc=arm_cortexM3l_math

# Upload menu
Other.menu.upload_method.DFUUploadMethod1=Maple bootloader (original version for Maple boards)
Other.menu.upload_method.DFUUploadMethod1.upload.protocol=maple_dfu
Other.menu.upload_method.DFUUploadMethod1.upload.tool=maple_upload
Other.menu.upload_method.DFUUploadMethod1.build.upload_flags=-DSERIAL_USB -DVECT_TAB_OFFSET=0x5000
Other.menu.upload_method.DFUUploadMethod1.build.ldscript=bootloader_original.ld
Other.menu.upload_method.DFUUploadMethod1.upload.usbID=1EAF:0003
Other.menu.upload_method.DFUUploadMethod1.upload.altID=1

Other.menu.upload_method.DFUUploadMethod=STM32duino bootloader
Other.menu.upload_method.DFUUploadMethod.upload.protocol=maple_dfu
Other.menu.upload_method.DFUUploadMethod.upload.tool=maple_upload
Other.menu.upload_method.DFUUploadMethod.build.upload_flags=-DSERIAL_USB -DVECT_TAB_OFFSET=0x2000
Other.menu.upload_method.DFUUploadMethod.build.ldscript=bootloader.ld
Other.menu.upload_method.DFUUploadMethod.upload.usbID=1EAF:0003
Other.menu.upload_method.DFUUploadMethod.upload.altID=2

Other.menu.upload_method.STLinkMethod=STLink
Other.menu.upload_method.STLinkMethod.upload.protocol=STLink
Other.menu.upload_method.STLinkMethod.upload.tool=stlink_upload
Other.menu.upload_method.STLinkMethod.build.upload_flags=-DSERIAL_USB

Other.menu.upload_method.serialMethod=Serial
Other.menu.upload_method.serialMethod.upload.protocol=maple_serial
Other.menu.upload_method.serialMethod.upload.tool=serial_upload
Other.menu.upload_method.serialMethod.build.upload_flags=

Other.menu.upload_method.BMPMethod=BMP (Black Magic Probe)
Other.menu.upload_method.BMPMethod.upload.protocol=gdb_bmp
Other.menu.upload_method.BMPMethod.upload.tool=bmp_upload
Other.menu.upload_method.BMPMethod.upload.speed=230400
Other.menu.upload_method.BMPMethod.build.upload_flags=

################################################################################
# Nucleo 144 boards

Nucleo_144.name=Nucleo-144

Nucleo_144.build.vid=0x0483
Nucleo_144.build.pid=0x5711
Nucleo_144.vid.0=0x0483
Nucleo_144.pid.0=0x5711

Nucleo_144.build.core=arduino
Nucleo_144.build.board=Nucleo_144
Nucleo_144.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}

# NUCLEO_F207ZG board
# Support: USB HID, Serial1 (USART1 on PG9, PG14) and Serial2 (USART2 on PD6, PD5)
Nucleo_144.menu.pnum.NUCLEO_F207ZG=Nucleo F207ZG
Nucleo_144.menu.pnum.NUCLEO_F207ZG.node=NODE_F207ZG
Nucleo_144.menu.pnum.NUCLEO_F207ZG.upload.maximum_size=1048576
Nucleo_144.menu.pnum.NUCLEO_F207ZG.upload.maximum_data_size=131072
Nucleo_144.menu.pnum.NUCLEO_F207ZG.build.mcu=cortex-m3
Nucleo_144.menu.pnum.NUCLEO_F207ZG.build.f_cpu=120000000L
Nucleo_144.menu.pnum.NUCLEO_F207ZG.build.board=NUCLEO_F207ZG
Nucleo_144.menu.pnum.NUCLEO_F207ZG.build.series=STM32F2xx
Nucleo_144.menu.pnum.NUCLEO_F207ZG.build.product_line=STM32F207xx
Nucleo_144.menu.pnum.NUCLEO_F207ZG.build.variant=NUCLEO_F207ZG
Nucleo_144.menu.pnum.NUCLEO_F207ZG.build.cmsis_lib_gcc=arm_cortexM3l_math

# NUCLEO_F429ZI board
# Support: USB HID, Serial1 (USART1 on PG9, PG14) and Serial2 (USART2 on PD6, PD5)
Nucleo_144.menu.pnum.NUCLEO_F429ZI=Nucleo F429ZI
Nucleo_144.menu.pnum.NUCLEO_F429ZI.node=NODE_F429ZI
Nucleo_144.menu.pnum.NUCLEO_F429ZI.upload.maximum_size=2097152
Nucleo_144.menu.pnum.NUCLEO_F429ZI.upload.maximum_data_size=262144
Nucleo_144.menu.pnum.NUCLEO_F429ZI.build.mcu=cortex-m4
Nucleo_144.menu.pnum.NUCLEO_F429ZI.build.f_cpu=16000000L
Nucleo_144.menu.pnum.NUCLEO_F429ZI.build.board=NUCLEO_F429ZI
Nucleo_144.menu.pnum.NUCLEO_F429ZI.build.series=STM32F4xx
Nucleo_144.menu.pnum.NUCLEO_F429ZI.build.product_line=STM32F429xx
Nucleo_144.menu.pnum.NUCLEO_F429ZI.build.variant=NUCLEO_F429ZI
Nucleo_144.menu.pnum.NUCLEO_F429ZI.build.cmsis_lib_gcc=arm_cortexM4l_math

# Upload menu
Nucleo_144.menu.upload_method.MassStorage=Mass Storage
Nucleo_144.menu.upload_method.MassStorage.upload.protocol=
Nucleo_144.menu.upload_method.MassStorage.upload.tool=massStorageCopy

Nucleo_144.menu.upload_method.STLink=STLink
Nucleo_144.menu.upload_method.STLink.upload.protocol=STLink
Nucleo_144.menu.upload_method.STLink.upload.tool=stlink_upload

################################################################################
# Nucleo 64 boards

Nucleo_64.name=Nucleo-64

Nucleo_64.build.vid=0x0483
Nucleo_64.build.pid=0x5711
Nucleo_64.vid.0=0x0483
Nucleo_64.pid.0=0x5711

Nucleo_64.build.core=arduino
Nucleo_64.build.board=Nucleo_64
Nucleo_64.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}

# NUCLEO_F030R8 board
# Support: Serial1 (USART1 on PA10, PA9)
Nucleo_64.menu.pnum.NUCLEO_F030R8=Nucleo F030R8
Nucleo_64.menu.pnum.NUCLEO_F030R8.node="NODE_F030R8,NUCLEO"
Nucleo_64.menu.pnum.NUCLEO_F030R8.upload.maximum_size=65536
Nucleo_64.menu.pnum.NUCLEO_F030R8.upload.maximum_data_size=8192
Nucleo_64.menu.pnum.NUCLEO_F030R8.build.mcu=cortex-m0
Nucleo_64.menu.pnum.NUCLEO_F030R8.build.f_cpu=48000000L
Nucleo_64.menu.pnum.NUCLEO_F030R8.build.board=NUCLEO_F030R8
Nucleo_64.menu.pnum.NUCLEO_F030R8.build.series=STM32F0xx
Nucleo_64.menu.pnum.NUCLEO_F030R8.build.product_line=STM32F030x8
Nucleo_64.menu.pnum.NUCLEO_F030R8.build.variant=NUCLEO_F030R8
Nucleo_64.menu.pnum.NUCLEO_F030R8.build.cmsis_lib_gcc=arm_cortexM0l_math

# NUCLEO_F091RC board
# Support: Serial1 (USART1 on PA10, PA9) and Serial2 (USART2 on PA1, PA0)
Nucleo_64.menu.pnum.NUCLEO_F091RC=Nucleo F091RC
Nucleo_64.menu.pnum.NUCLEO_F091RC.node=NODE_F091RC
Nucleo_64.menu.pnum.NUCLEO_F091RC.upload.maximum_size=262144
Nucleo_64.menu.pnum.NUCLEO_F091RC.upload.maximum_data_size=32768
Nucleo_64.menu.pnum.NUCLEO_F091RC.build.mcu=cortex-m0
Nucleo_64.menu.pnum.NUCLEO_F091RC.build.f_cpu=8000000L
Nucleo_64.menu.pnum.NUCLEO_F091RC.build.board=NUCLEO_F091RC
Nucleo_64.menu.pnum.NUCLEO_F091RC.build.series=STM32F0xx
Nucleo_64.menu.pnum.NUCLEO_F091RC.build.product_line=STM32F091xC
Nucleo_64.menu.pnum.NUCLEO_F091RC.build.variant=NUCLEO_F091RC
Nucleo_64.menu.pnum.NUCLEO_F091RC.build.cmsis_lib_gcc=arm_cortexM0l_math

# NUCLEO_F103RB board
# Support: Serial1 (USART1 on PA10, PA9) and Serial2 (USART3 on PC11, PC10)
Nucleo_64.menu.pnum.NUCLEO_F103RB=Nucleo F103RB
Nucleo_64.menu.pnum.NUCLEO_F103RB.node="NODE_F103RB,NUCLEO"
Nucleo_64.menu.pnum.NUCLEO_F103RB.upload.maximum_size=131072
Nucleo_64.menu.pnum.NUCLEO_F103RB.upload.maximum_data_size=20480
Nucleo_64.menu.pnum.NUCLEO_F103RB.build.mcu=cortex-m3
Nucleo_64.menu.pnum.NUCLEO_F103RB.build.f_cpu=72000000L
Nucleo_64.menu.pnum.NUCLEO_F103RB.build.board=NUCLEO_F103RB
Nucleo_64.menu.pnum.NUCLEO_F103RB.build.series=STM32F1xx
Nucleo_64.menu.pnum.NUCLEO_F103RB.build.product_line=STM32F103xB
Nucleo_64.menu.pnum.NUCLEO_F103RB.build.variant=NUCLEO_F103RB
Nucleo_64.menu.pnum.NUCLEO_F103RB.build.cmsis_lib_gcc=arm_cortexM3l_math

# NUCLEO_F303RE board
# Support: Serial1 (USART1 on PA10, PA9) and Serial2 (USART2 on PA1, PA0)
Nucleo_64.menu.pnum.NUCLEO_F303RE=Nucleo F303RE
Nucleo_64.menu.pnum.NUCLEO_F303RE.node=NODE_F303RE
Nucleo_64.menu.pnum.NUCLEO_F303RE.upload.maximum_size=524288
Nucleo_64.menu.pnum.NUCLEO_F303RE.upload.maximum_data_size=65536
Nucleo_64.menu.pnum.NUCLEO_F303RE.build.mcu=cortex-m4
Nucleo_64.menu.pnum.NUCLEO_F303RE.build.f_cpu=8000000L
Nucleo_64.menu.pnum.NUCLEO_F303RE.build.board=NUCLEO_F303RE
Nucleo_64.menu.pnum.NUCLEO_F303RE.build.series=STM32F3xx
Nucleo_64.menu.pnum.NUCLEO_F303RE.build.product_line=STM32F303xE
Nucleo_64.menu.pnum.NUCLEO_F303RE.build.variant=NUCLEO_F303RE
Nucleo_64.menu.pnum.NUCLEO_F303RE.build.cmsis_lib_gcc=arm_cortexM4l_math

# NUCLEO_F401RE board
# Support: Serial1 (USART1 on PA10, PA9) and Serial2 (USART2 on PA1, PA0)
Nucleo_64.menu.pnum.NUCLEO_F401RE=Nucleo F401RE
Nucleo_64.menu.pnum.NUCLEO_F401RE.node=NODE_F401RE
Nucleo_64.menu.pnum.NUCLEO_F401RE.upload.maximum_size=524288
Nucleo_64.menu.pnum.NUCLEO_F401RE.upload.maximum_data_size=98304
Nucleo_64.menu.pnum.NUCLEO_F401RE.build.mcu=cortex-m4
Nucleo_64.menu.pnum.NUCLEO_F401RE.build.f_cpu=84000000L
Nucleo_64.menu.pnum.NUCLEO_F401RE.build.board=NUCLEO_F401RE
Nucleo_64.menu.pnum.NUCLEO_F401RE.build.series=STM32F4xx
Nucleo_64.menu.pnum.NUCLEO_F401RE.build.product_line=STM32F401xE
Nucleo_64.menu.pnum.NUCLEO_F401RE.build.variant=NUCLEO_F401RE
Nucleo_64.menu.pnum.NUCLEO_F401RE.build.cmsis_lib_gcc=arm_cortexM4l_math

# NUCLEO_F411RE board
# Support: Serial1 (USART1 on PA10, PA9) and Serial2 (USART2 on PC7, PC6)
Nucleo_64.menu.pnum.NUCLEO_F411RE=Nucleo F411RE
Nucleo_64.menu.pnum.NUCLEO_F411RE.node=NODE_F411RE
Nucleo_64.menu.pnum.NUCLEO_F411RE.upload.maximum_size=524288
Nucleo_64.menu.pnum.NUCLEO_F411RE.upload.maximum_data_size=131072
Nucleo_64.menu.pnum.NUCLEO_F411RE.build.mcu=cortex-m4
Nucleo_64.menu.pnum.NUCLEO_F411RE.build.f_cpu=100000000L
Nucleo_64.menu.pnum.NUCLEO_F411RE.build.board=NUCLEO_F411RE
Nucleo_64.menu.pnum.NUCLEO_F411RE.build.series=STM32F4xx
Nucleo_64.menu.pnum.NUCLEO_F411RE.build.product_line=STM32F411xE
Nucleo_64.menu.pnum.NUCLEO_F411RE.build.variant=NUCLEO_F411RE
Nucleo_64.menu.pnum.NUCLEO_F411RE.build.cmsis_lib_gcc=arm_cortexM4l_math

# NUCLEO_L053R8 board
# Support: Serial1 (USART1 on PA10, PA9)
Nucleo_64.menu.pnum.NUCLEO_L053R8=Nucleo L053R8
Nucleo_64.menu.pnum.NUCLEO_L053R8.node=NODE_L053R8
Nucleo_64.menu.pnum.NUCLEO_L053R8.upload.maximum_size=65536
Nucleo_64.menu.pnum.NUCLEO_L053R8.upload.maximum_data_size=8192
Nucleo_64.menu.pnum.NUCLEO_L053R8.build.mcu=cortex-m0
Nucleo_64.menu.pnum.NUCLEO_L053R8.build.f_cpu=2000000L
Nucleo_64.menu.pnum.NUCLEO_L053R8.build.board=NUCLEO_L053R8
Nucleo_64.menu.pnum.NUCLEO_L053R8.build.series=STM32L0xx
Nucleo_64.menu.pnum.NUCLEO_L053R8.build.product_line=STM32L053xx
Nucleo_64.menu.pnum.NUCLEO_L053R8.build.variant=NUCLEO_L053R8
Nucleo_64.menu.pnum.NUCLEO_L053R8.build.cmsis_lib_gcc=arm_cortexM0l_math
Nucleo_64.menu.pnum.NUCLEO_L053R8.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -D__CORTEX_SC=0

# NUCLEO_L152RE board
# Support: Serial1 (USART1 on PA10, PA9) and Serial2 (UART4 on PC11, PC10)
Nucleo_64.menu.pnum.NUCLEO_L152RE=Nucleo L152RE
Nucleo_64.menu.pnum.NUCLEO_L152RE.node="NODE_L152RE,NUCLEO"
Nucleo_64.menu.pnum.NUCLEO_L152RE.upload.maximum_size=524288
Nucleo_64.menu.pnum.NUCLEO_L152RE.upload.maximum_data_size=81920
Nucleo_64.menu.pnum.NUCLEO_L152RE.build.mcu=cortex-m3
Nucleo_64.menu.pnum.NUCLEO_L152RE.build.f_cpu=32000000L
Nucleo_64.menu.pnum.NUCLEO_L152RE.build.board=NUCLEO_L152RE
Nucleo_64.menu.pnum.NUCLEO_L152RE.build.series=STM32L1xx
Nucleo_64.menu.pnum.NUCLEO_L152RE.build.product_line=STM32L152xE
Nucleo_64.menu.pnum.NUCLEO_L152RE.build.variant=NUCLEO_L152RE
Nucleo_64.menu.pnum.NUCLEO_L152RE.build.cmsis_lib_gcc=arm_cortexM3l_math

# NUCLEO_L476RG board
# Support: Serial1 (USART1 on PA10, PA9)
Nucleo_64.menu.pnum.NUCLEO_L476RG=Nucleo L476RG
Nucleo_64.menu.pnum.NUCLEO_L476RG.node=NODE_L476RG
Nucleo_64.menu.pnum.NUCLEO_L476RG.upload.maximum_size=1048576
Nucleo_64.menu.pnum.NUCLEO_L476RG.upload.maximum_data_size=131072
Nucleo_64.menu.pnum.NUCLEO_L476RG.build.mcu=cortex-m4
Nucleo_64.menu.pnum.NUCLEO_L476RG.build.f_cpu=80000000L
Nucleo_64.menu.pnum.NUCLEO_L476RG.build.board=NUCLEO_L476RG
Nucleo_64.menu.pnum.NUCLEO_L476RG.build.series=STM32L4xx
Nucleo_64.menu.pnum.NUCLEO_L476RG.build.product_line=STM32L476xx
Nucleo_64.menu.pnum.NUCLEO_L476RG.build.variant=NUCLEO_L476RG
Nucleo_64.menu.pnum.NUCLEO_L476RG.build.cmsis_lib_gcc=arm_cortexM4l_math

# Upload menu
Nucleo_64.menu.upload_method.MassStorage=Mass Storage
Nucleo_64.menu.upload_method.MassStorage.upload.protocol=
Nucleo_64.menu.upload_method.MassStorage.upload.tool=massStorageCopy

Nucleo_64.menu.upload_method.STLink=STLink
Nucleo_64.menu.upload_method.STLink.upload.protocol=STLink
Nucleo_64.menu.upload_method.STLink.upload.tool=stlink_upload

################################################################################
# Nucleo 32 boards

Nucleo_32.name=Nucleo-32

