caniggia1/Arduino_Core_STM32_1.0.1/STM32/hardware/stm32/1.0.1/boards.txt
Nucleo_32.build.vid=0x0483
Nucleo_32.build.pid=0x5711
Nucleo_32.vid.0=0x0483
Nucleo_32.pid.0=0x5711

Nucleo_32.build.core=arduino
Nucleo_32.build.board=Nucleo_32
Nucleo_32.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}

# NUCLEO_L432KC board
# Support: Serial1 (USART1 on PA10, PA9)
Nucleo_32.menu.pnum.NUCLEO_L432KC=Nucleo L432KC
Nucleo_32.menu.pnum.NUCLEO_L432KC.node=NODE_L432KC
Nucleo_32.menu.pnum.NUCLEO_L432KC.upload.maximum_size=262144
Nucleo_32.menu.pnum.NUCLEO_L432KC.upload.maximum_data_size=65536
Nucleo_32.menu.pnum.NUCLEO_L432KC.build.mcu=cortex-m4
Nucleo_32.menu.pnum.NUCLEO_L432KC.build.f_cpu=80000000L
Nucleo_32.menu.pnum.NUCLEO_L432KC.build.board=NUCLEO_L432KC
Nucleo_32.menu.pnum.NUCLEO_L432KC.build.series=STM32L4xx
Nucleo_32.menu.pnum.NUCLEO_L432KC.build.product_line=STM32L432xx
Nucleo_32.menu.pnum.NUCLEO_L432KC.build.variant=NUCLEO_L432KC
Nucleo_32.menu.pnum.NUCLEO_L432KC.build.cmsis_lib_gcc=arm_cortexM4l_math

# Upload menu
Nucleo_32.menu.upload_method.MassStorage=Mass Storage
Nucleo_32.menu.upload_method.MassStorage.upload.protocol=
Nucleo_32.menu.upload_method.MassStorage.upload.tool=massStorageCopy

Nucleo_32.menu.upload_method.STLink=STLink
Nucleo_32.menu.upload_method.STLink.upload.protocol=STLink
Nucleo_32.menu.upload_method.STLink.upload.tool=stlink_upload

################################################################################
# Discovery boards

Disco.name=Discovery

Disco.build.vid=0x0483
Disco.build.pid=0x5711
Disco.vid.0=0x0483
Disco.pid.0=0x5711

Disco.build.core=arduino
Disco.build.board=Disco
Disco.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}

#DISCO_F100RB board
# Support: Serial1 (USART1 on PA10, PA9) and Serial2 (USART3 on PB11, PB10)
Disco.menu.pnum.DISCO_F100RB=STM32F100RB-DISCVL
Disco.menu.pnum.DISCO_F100RB.node=DIS_F100RB
Disco.menu.pnum.DISCO_F100RB.upload.maximum_size=131071
Disco.menu.pnum.DISCO_F100RB.upload.maximum_data_size=8192
Disco.menu.pnum.DISCO_F100RB.build.mcu=cortex-m3
Disco.menu.pnum.DISCO_F100RB.build.f_cpu=24000000L
Disco.menu.pnum.DISCO_F100RB.build.board=DISCO_F100RB
Disco.menu.pnum.DISCO_F100RB.build.series=STM32F1xx
Disco.menu.pnum.DISCO_F100RB.build.product_line=STM32F100xB
Disco.menu.pnum.DISCO_F100RB.build.variant=DISCO_F100RB
Disco.menu.pnum.DISCO_F100RB.build.cmsis_lib_gcc=arm_cortexM3l_math

# DISCO_F407VG board
# Support: USB HID
Disco.menu.pnum.DISCO_F407VG=STM32F407G-DISC1
Disco.menu.pnum.DISCO_F407VG.node=DIS_F407VG
Disco.menu.pnum.DISCO_F407VG.upload.maximum_size=1048576
Disco.menu.pnum.DISCO_F407VG.upload.maximum_data_size=196608
Disco.menu.pnum.DISCO_F407VG.build.mcu=cortex-m4
Disco.menu.pnum.DISCO_F407VG.build.f_cpu=16000000L
Disco.menu.pnum.DISCO_F407VG.build.board=DISCO_F407VG
Disco.menu.pnum.DISCO_F407VG.build.series=STM32F4xx
Disco.menu.pnum.DISCO_F407VG.build.product_line=STM32F407xx
Disco.menu.pnum.DISCO_F407VG.build.variant=DISCO_F407VG
Disco.menu.pnum.DISCO_F407VG.build.cmsis_lib_gcc=arm_cortexM4l_math

# DISCO_F746NG board
# Support: USB HID, Serial1 (USART6 on PC7, PC6) and Serial2 (UART7 on PF6, PF7)
Disco.menu.pnum.DISCO_F746NG=STM32F746G-DISCOVERY
Disco.menu.pnum.DISCO_F746NG.node=DIS_F746NG
Disco.menu.pnum.DISCO_F746NG.upload.maximum_size=1048576
Disco.menu.pnum.DISCO_F746NG.upload.maximum_data_size=327680
Disco.menu.pnum.DISCO_F746NG.build.mcu=cortex-m7
Disco.menu.pnum.DISCO_F746NG.build.f_cpu=216000000L
Disco.menu.pnum.DISCO_F746NG.build.board=DISCO_F746NG
Disco.menu.pnum.DISCO_F746NG.build.series=STM32F7xx
Disco.menu.pnum.DISCO_F746NG.build.product_line=STM32F746xx
Disco.menu.pnum.DISCO_F746NG.build.variant=DISCO_F746NG
Disco.menu.pnum.DISCO_F746NG.build.cmsis_lib_gcc=arm_cortexM7l_math

# DISCO_L475VG_IOT board
# Support: USB HID, Serial1 (USART1 on PA1, PA0)
Disco.menu.pnum.DISCO_L475VG_IOT=STM32L475VG-DISCOVERY-IOT
Disco.menu.pnum.DISCO_L475VG_IOT.node=DIS_L4IOT
Disco.menu.pnum.DISCO_L475VG_IOT.upload.maximum_size=1048576
Disco.menu.pnum.DISCO_L475VG_IOT.upload.maximum_data_size=98304
Disco.menu.pnum.DISCO_L475VG_IOT.build.mcu=cortex-m4
Disco.menu.pnum.DISCO_L475VG_IOT.build.f_cpu=80000000L
Disco.menu.pnum.DISCO_L475VG_IOT.build.board=DISCO_L475VG_IOT
Disco.menu.pnum.DISCO_L475VG_IOT.build.series=STM32L4xx
Disco.menu.pnum.DISCO_L475VG_IOT.build.product_line=STM32L475xx
Disco.menu.pnum.DISCO_L475VG_IOT.build.variant=DISCO_L475VG_IOT
Disco.menu.pnum.DISCO_L475VG_IOT.build.cmsis_lib_gcc=arm_cortexM4l_math

# Upload menu
Disco.menu.upload_method.MassStorage=Mass Storage
Disco.menu.upload_method.MassStorage.upload.protocol=
Disco.menu.upload_method.MassStorage.upload.tool=massStorageCopy

Disco.menu.upload_method.STLink=STLink
Disco.menu.upload_method.STLink.upload.protocol=STLink
Disco.menu.upload_method.STLink.upload.tool=stlink_upload


################################################################################
# Serialx activation
generic_F1.menu.xserial.none=None
generic_F1.menu.xserial.SerialAll=All
generic_F1.menu.xserial.SerialAll.build.xSerial=-DENABLE_SERIAL2 -DENABLE_SERIAL3
generic_F1.menu.xserial.Serial2=Serial2 (if available)
generic_F1.menu.xserial.Serial2.build.xSerial=-DENABLE_SERIAL2
generic_F1.menu.xserial.Serial3=Serial3 (if available)
generic_F1.menu.xserial.Serial3.build.xSerial=-DENABLE_SERIAL3

Other.menu.xserial.none=None
Other.menu.xserial.SerialAll=All
Other.menu.xserial.SerialAll.build.xSerial=-DENABLE_SERIAL2 -DENABLE_SERIAL3
Other.menu.xserial.Serial2=Serial2 (if available)
Other.menu.xserial.Serial2.build.xSerial=-DENABLE_SERIAL2
Other.menu.xserial.Serial3=Serial3 (if available)
Other.menu.xserial.Serial3.build.xSerial=-DENABLE_SERIAL3

Nucleo_144.menu.xserial.none=None
Nucleo_144.menu.xserial.SerialAll=All
Nucleo_144.menu.xserial.SerialAll.build.xSerial=-DENABLE_SERIAL1 -DENABLE_SERIAL2
Nucleo_144.menu.xserial.Serial1=Serial1 (if available)
Nucleo_144.menu.xserial.Serial1.build.xSerial=-DENABLE_SERIAL1
Nucleo_144.menu.xserial.Serial2=Serial2 (if available)
Nucleo_144.menu.xserial.Serial2.build.xSerial=-DENABLE_SERIAL2

Nucleo_64.menu.xserial.none=None
Nucleo_64.menu.xserial.SerialAll=All
Nucleo_64.menu.xserial.SerialAll.build.xSerial=-DENABLE_SERIAL1 -DENABLE_SERIAL2
Nucleo_64.menu.xserial.Serial1=Serial1 (if available)
Nucleo_64.menu.xserial.Serial1.build.xSerial=-DENABLE_SERIAL1
Nucleo_64.menu.xserial.Serial2=Serial2 (if available)
Nucleo_64.menu.xserial.Serial2.build.xSerial=-DENABLE_SERIAL2

Nucleo_32.menu.xserial.none=None
Nucleo_32.menu.xserial.SerialAll=All
Nucleo_32.menu.xserial.SerialAll.build.xSerial=-DENABLE_SERIAL1 -DENABLE_SERIAL2
Nucleo_32.menu.xserial.Serial1=Serial1 (if available)
Nucleo_32.menu.xserial.Serial1.build.xSerial=-DENABLE_SERIAL1
Nucleo_32.menu.xserial.Serial2=Serial2 (if available)
Nucleo_32.menu.xserial.Serial2.build.xSerial=-DENABLE_SERIAL2

Disco.menu.xserial.none=None
Disco.menu.xserial.SerialAll=All
Disco.menu.xserial.SerialAll.build.xSerial=-DENABLE_SERIAL1 -DENABLE_SERIAL2
Disco.menu.xserial.Serial1=Serial1 (if available)
Disco.menu.xserial.Serial1.build.xSerial=-DENABLE_SERIAL1
Disco.menu.xserial.Serial2=Serial2 (if available)
Disco.menu.xserial.Serial2.build.xSerial=-DENABLE_SERIAL2

# USB connectivity
generic_F1.menu.usb.none=None
generic_F1.menu.usb.HID=HID keyboard and mouse support (if available)
generic_F1.menu.usb.HID.build.enable_usb={build.usb_flags} -DUSBD_USE_HID_COMPOSITE
#generic_F1.menu.usb.CDC=CDC (if available)
#generic_F1.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DUSE_USB_FS

