caniggia1/Arduino_Core_STM32_1.0.1/STM32/hardware/stm32/1.0.1/boards.txt
Other.menu.usb.none=None
Other.menu.usb.HID=HID keyboard and mouse support (if available)
Other.menu.usb.HID.build.enable_usb={build.usb_flags} -DUSBD_USE_HID_COMPOSITE
Other.menu.usb.CDC=CDC (if available)
Other.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DUSE_USB_FS

Nucleo_144.menu.usb.none=None
Nucleo_144.menu.usb.HID=HID keyboard and mouse support (if available)
Nucleo_144.menu.usb.HID.build.enable_usb={build.usb_flags} -DUSBD_USE_HID_COMPOSITE
#Nucleo_144.menu.usb.CDC=CDC (if available)
#Nucleo_144.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DUSE_USB_FS

Nucleo_64.menu.usb.none=None
Nucleo_64.menu.usb.HID=HID keyboard and mouse support (if available)
Nucleo_64.menu.usb.HID.build.enable_usb={build.usb_flags} -DUSBD_USE_HID_COMPOSITE
#Nucleo_64.menu.usb.CDC=CDC (if available)
#Nucleo_64.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DUSE_USB_FS

Nucleo_32.menu.usb.none=None
Nucleo_32.menu.usb.HID=HID keyboard and mouse support (if available)
Nucleo_32.menu.usb.HID.build.enable_usb={build.usb_flags} -DUSBD_USE_HID_COMPOSITE
#Nucleo_32.menu.usb.CDC=CDC (if available)
#Nucleo_32.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DUSE_USB_FS

Disco.menu.usb.none=None
Disco.menu.usb.HID=HID keyboard and mouse support (if available)
Disco.menu.usb.HID.build.enable_usb={build.usb_flags} -DUSBD_USE_HID_COMPOSITE
#Disco.menu.usb.CDC=CDC (if available)
#Disco.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DUSE_USB_FS

# Optimizations
generic_F1.menu.opt.osstd=Smallest (-Os default)
generic_F1.menu.opt.osstd.build.flags.optimize=-Os
generic_F1.menu.opt.osstd.build.flags.ldspecs=
generic_F1.menu.opt.oslto=Smallest (-Os) with LTO
generic_F1.menu.opt.oslto.build.flags.optimize=-Os -flto
generic_F1.menu.opt.oslto.build.flags.ldspecs=-flto
generic_F1.menu.opt.o1std=Fast (-O1)
generic_F1.menu.opt.o1std.build.flags.optimize=-O1
generic_F1.menu.opt.o1std.build.flags.ldspecs=
generic_F1.menu.opt.o1lto=Fast (-O1) with LTO
generic_F1.menu.opt.o1lto.build.flags.optimize=-O1 -flto
generic_F1.menu.opt.o1lto.build.flags.ldspecs=-flto
generic_F1.menu.opt.o2std=Faster (-O2)
generic_F1.menu.opt.o2std.build.flags.optimize=-O2
generic_F1.menu.opt.o2std.build.flags.ldspecs=
generic_F1.menu.opt.o2lto=Faster (-O2) with LTO
generic_F1.menu.opt.o2lto.build.flags.optimize=-O2 -flto
generic_F1.menu.opt.o2lto.build.flags.ldspecs=-flto
generic_F1.menu.opt.o3std=Fastest (-O3)
generic_F1.menu.opt.o3std.build.flags.optimize=-O3
generic_F1.menu.opt.o3std.build.flags.ldspecs=
generic_F1.menu.opt.o3lto=Fastest (-O3) with LTO
generic_F1.menu.opt.o3lto.build.flags.optimize=-O3 -flto
generic_F1.menu.opt.o3lto.build.flags.ldspecs=-flto
generic_F1.menu.opt.ogstd=Debug (-g)
generic_F1.menu.opt.ogstd.build.flags.optimize=-Og
generic_F1.menu.opt.ogstd.build.flags.ldspecs=

Other.menu.opt.osstd=Smallest (-Os default)
Other.menu.opt.osstd.build.flags.optimize=-Os
Other.menu.opt.osstd.build.flags.ldspecs=
Other.menu.opt.oslto=Smallest (-Os) with LTO
Other.menu.opt.oslto.build.flags.optimize=-Os -flto
Other.menu.opt.oslto.build.flags.ldspecs=-flto
Other.menu.opt.o1std=Fast (-O1)
Other.menu.opt.o1std.build.flags.optimize=-O1
Other.menu.opt.o1std.build.flags.ldspecs=
Other.menu.opt.o1lto=Fast (-O1) with LTO
Other.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Other.menu.opt.o1lto.build.flags.ldspecs=-flto
Other.menu.opt.o2std=Faster (-O2)
Other.menu.opt.o2std.build.flags.optimize=-O2
Other.menu.opt.o2std.build.flags.ldspecs=
Other.menu.opt.o2lto=Faster (-O2) with LTO
Other.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Other.menu.opt.o2lto.build.flags.ldspecs=-flto
Other.menu.opt.o3std=Fastest (-O3)
Other.menu.opt.o3std.build.flags.optimize=-O3
Other.menu.opt.o3std.build.flags.ldspecs=
Other.menu.opt.o3lto=Fastest (-O3) with LTO
Other.menu.opt.o3lto.build.flags.optimize=-O3 -flto
Other.menu.opt.o3lto.build.flags.ldspecs=-flto
Other.menu.opt.ogstd=Debug (-g)
Other.menu.opt.ogstd.build.flags.optimize=-Og
Other.menu.opt.ogstd.build.flags.ldspecs=

Nucleo_144.menu.opt.osstd=Smallest (-Os default)
Nucleo_144.menu.opt.osstd.build.flags.optimize=-Os
Nucleo_144.menu.opt.osstd.build.flags.ldspecs=
Nucleo_144.menu.opt.oslto=Smallest (-Os) with LTO
Nucleo_144.menu.opt.oslto.build.flags.optimize=-Os -flto
Nucleo_144.menu.opt.oslto.build.flags.ldspecs=-flto
Nucleo_144.menu.opt.o1std=Fast (-O1)
Nucleo_144.menu.opt.o1std.build.flags.optimize=-O1
Nucleo_144.menu.opt.o1std.build.flags.ldspecs=
Nucleo_144.menu.opt.o1lto=Fast (-O1) with LTO
Nucleo_144.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Nucleo_144.menu.opt.o1lto.build.flags.ldspecs=-flto
Nucleo_144.menu.opt.o2std=Faster (-O2)
Nucleo_144.menu.opt.o2std.build.flags.optimize=-O2
Nucleo_144.menu.opt.o2std.build.flags.ldspecs=
Nucleo_144.menu.opt.o2lto=Faster (-O2) with LTO
Nucleo_144.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Nucleo_144.menu.opt.o2lto.build.flags.ldspecs=-flto
Nucleo_144.menu.opt.o3std=Fastest (-O3)
Nucleo_144.menu.opt.o3std.build.flags.optimize=-O3
Nucleo_144.menu.opt.o3std.build.flags.ldspecs=
Nucleo_144.menu.opt.o3lto=Fastest (-O3) with LTO
Nucleo_144.menu.opt.o3lto.build.flags.optimize=-O3 -flto
Nucleo_144.menu.opt.o3lto.build.flags.ldspecs=-flto
Nucleo_144.menu.opt.ogstd=Debug (-g)
Nucleo_144.menu.opt.ogstd.build.flags.optimize=-Og
Nucleo_144.menu.opt.ogstd.build.flags.ldspecs=

Nucleo_64.menu.opt.osstd=Smallest (-Os default)
Nucleo_64.menu.opt.osstd.build.flags.optimize=-Os
Nucleo_64.menu.opt.osstd.build.flags.ldspecs=
Nucleo_64.menu.opt.oslto=Smallest (-Os) with LTO
Nucleo_64.menu.opt.oslto.build.flags.optimize=-Os -flto
Nucleo_64.menu.opt.oslto.build.flags.ldspecs=-flto
Nucleo_64.menu.opt.o1std=Fast (-O1)
Nucleo_64.menu.opt.o1std.build.flags.optimize=-O1
Nucleo_64.menu.opt.o1std.build.flags.ldspecs=
Nucleo_64.menu.opt.o1lto=Fast (-O1) with LTO
Nucleo_64.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Nucleo_64.menu.opt.o1lto.build.flags.ldspecs=-flto
Nucleo_64.menu.opt.o2std=Faster (-O2)
Nucleo_64.menu.opt.o2std.build.flags.optimize=-O2
Nucleo_64.menu.opt.o2std.build.flags.ldspecs=
Nucleo_64.menu.opt.o2lto=Faster (-O2) with LTO
Nucleo_64.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Nucleo_64.menu.opt.o2lto.build.flags.ldspecs=-flto
Nucleo_64.menu.opt.o3std=Fastest (-O3)
Nucleo_64.menu.opt.o3std.build.flags.optimize=-O3
Nucleo_64.menu.opt.o3std.build.flags.ldspecs=
Nucleo_64.menu.opt.o3lto=Fastest (-O3) with LTO
Nucleo_64.menu.opt.o3lto.build.flags.optimize=-O3 -flto
Nucleo_64.menu.opt.o3lto.build.flags.ldspecs=-flto
Nucleo_64.menu.opt.ogstd=Debug (-g)
Nucleo_64.menu.opt.ogstd.build.flags.optimize=-Og
Nucleo_64.menu.opt.ogstd.build.flags.ldspecs=

Nucleo_32.menu.opt.osstd=Smallest (-Os default)
Nucleo_32.menu.opt.osstd.build.flags.optimize=-Os
Nucleo_32.menu.opt.osstd.build.flags.ldspecs=
Nucleo_32.menu.opt.oslto=Smallest (-Os) with LTO
Nucleo_32.menu.opt.oslto.build.flags.optimize=-Os -flto
Nucleo_32.menu.opt.oslto.build.flags.ldspecs=-flto
Nucleo_32.menu.opt.o1std=Fast (-O1)
Nucleo_32.menu.opt.o1std.build.flags.optimize=-O1
Nucleo_32.menu.opt.o1std.build.flags.ldspecs=
Nucleo_32.menu.opt.o1lto=Fast (-O1) with LTO
Nucleo_32.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Nucleo_32.menu.opt.o1lto.build.flags.ldspecs=-flto
Nucleo_32.menu.opt.o2std=Faster (-O2)
Nucleo_32.menu.opt.o2std.build.flags.optimize=-O2
Nucleo_32.menu.opt.o2std.build.flags.ldspecs=
Nucleo_32.menu.opt.o2lto=Faster (-O2) with LTO
Nucleo_32.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Nucleo_32.menu.opt.o2lto.build.flags.ldspecs=-flto
Nucleo_32.menu.opt.o3std=Fastest (-O3)
Nucleo_32.menu.opt.o3std.build.flags.optimize=-O3
Nucleo_32.menu.opt.o3std.build.flags.ldspecs=
Nucleo_32.menu.opt.o3lto=Fastest (-O3) with LTO
Nucleo_32.menu.opt.o3lto.build.flags.optimize=-O3 -flto
Nucleo_32.menu.opt.o3lto.build.flags.ldspecs=-flto
Nucleo_32.menu.opt.ogstd=Debug (-g)
Nucleo_32.menu.opt.ogstd.build.flags.optimize=-Og
Nucleo_32.menu.opt.ogstd.build.flags.ldspecs=

Disco.menu.opt.osstd=Smallest (-Os default)
Disco.menu.opt.osstd.build.flags.optimize=-Os
Disco.menu.opt.osstd.build.flags.ldspecs=
Disco.menu.opt.oslto=Smallest (-Os) with LTO
Disco.menu.opt.oslto.build.flags.optimize=-Os -flto
Disco.menu.opt.oslto.build.flags.ldspecs=-flto
Disco.menu.opt.o1std=Fast (-O1)
Disco.menu.opt.o1std.build.flags.optimize=-O1
Disco.menu.opt.o1std.build.flags.ldspecs=
Disco.menu.opt.o1lto=Fast (-O1) with LTO
Disco.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Disco.menu.opt.o1lto.build.flags.ldspecs=-flto
Disco.menu.opt.o2std=Faster (-O2)
Disco.menu.opt.o2std.build.flags.optimize=-O2
Disco.menu.opt.o2std.build.flags.ldspecs=
Disco.menu.opt.o2lto=Faster (-O2) with LTO
Disco.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Disco.menu.opt.o2lto.build.flags.ldspecs=-flto
Disco.menu.opt.o3std=Fastest (-O3)
Disco.menu.opt.o3std.build.flags.optimize=-O3
Disco.menu.opt.o3std.build.flags.ldspecs=
Disco.menu.opt.o3lto=Fastest (-O3) with LTO
Disco.menu.opt.o3lto.build.flags.optimize=-O3 -flto
Disco.menu.opt.o3lto.build.flags.ldspecs=-flto
Disco.menu.opt.ogstd=Debug (-g)
Disco.menu.opt.ogstd.build.flags.optimize=-Og
Disco.menu.opt.ogstd.build.flags.ldspecs=
